perf/spaceNewsVol2.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 20
      arrivalRate: 1
      rampTo: 5
    - name: Plain
      duration: 30
      arrivalRate: 5
    - name: ramp
      duration: 30
      arrivalRate: 5
      rampTo: 30
    - name: Plain
      duration: 30
      arrivalRate: 30
    - name: ramp
      duration: 30
      arrivalRate: 30
      rampTo: 50
    

scenarios:
  - name: Space News (/space_news)
    flow:
      - get:
          url: '/space_news'